       IDENTIFICATION DIVISION.
       PROGRAM-ID. TestScoped.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  args_main-ARRAY.
           05  args_main    PIC X(100) OCCURS 100 TIMES.
       01  args_main-MAX   PIC S9(9) VALUE 100.
       01  TESTSCOPED-OBJ.
           05  TESTSCOPED-OBJ-NAME         PIC X(100).
           05  TESTSCOPED-OBJ-AGE          PIC S9(9).
       01  TESTSCOPED-D-INST.
           05  TESTSCOPED-D-INST-NAME         PIC X(100).
           05  TESTSCOPED-D-INST-AGE          PIC S9(9).


       PROCEDURE DIVISION.


       ENTRY-PARA.
           PERFORM MAIN-PARA
           STOP RUN.


       TESTSCOPED-SPEAK-PARA.
       DISPLAY TESTSCOPED-OBJ-NAME
       EXIT.


       MAIN-PARA.
       INITIALIZE TESTSCOPED-D-INST
       MOVE "Rex" TO TESTSCOPED-D-INST-NAME
       MOVE 3 TO TESTSCOPED-D-INST-AGE
       MOVE TESTSCOPED-D-INST TO TESTSCOPED-OBJ
       PERFORM TESTSCOPED-SPEAK-PARA
       MOVE TESTSCOPED-OBJ TO TESTSCOPED-D-INST
       DISPLAY TESTSCOPED-D-INST-AGE
       EXIT.


