       IDENTIFICATION DIVISION.
       PROGRAM-ID. .


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:
           05  x_sayHello   PIC 9(5).
