       IDENTIFICATION DIVISION.
       PROGRAM-ID. .


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:
           05  x_calc       PIC S9(5).
           05  y_calc       PIC S9(5).
