       IDENTIFICATION DIVISION.
       PROGRAM-ID. .


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:
       01  ARGS_[SIZE=[]]-ARRAY.
           05  args         PIC X(10) OCCURS 100 TIMES
