       IDENTIFICATION DIVISION.
       PROGRAM-ID. anyBaseToDecimal.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:anyBaseToDecimal
           05  rv_anyBaseToDecimal PIC S9(5).
           05  p_anyBaseToDecimal PIC S9(5).
           05  d_anyBaseToDecimal PIC S9(5).
           05  n_decimalToAnyBase PIC S9(5).
           05  b_decimalToAnyBase PIC S9(5).
