       IDENTIFICATION DIVISION.
       PROGRAM-ID. armstrong_check.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:armstrong_check
           05  temp_armstrong_check PIC S9(5).
           05  rem_armstrong_check PIC S9(5).
           05  result_armstrong_check PIC S9(5).
           05  power_armstrong_check PIC S9(5).
