       IDENTIFICATION DIVISION.
       PROGRAM-ID. arrange.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:arrange
           05  idx_arrange  PIC S9(5).
           05  i_arrange    PIC S9(5).
           05  i_arrange    PIC S9(5).
