       IDENTIFICATION DIVISION.
       PROGRAM-ID. arrayRotateCheck.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:arrayRotateCheck
           05  value_arrayRotateCheck PIC S9(5).
           05  i_arrayRotateCheck PIC S9(5).
