       IDENTIFICATION DIVISION.
       PROGRAM-ID. binarySearch.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:binarySearch
           05  s_binarySearch PIC S9(5).
           05  e_binarySearch PIC S9(5).
           05  m_binarySearch PIC S9(5).
