       IDENTIFICATION DIVISION.
       PROGRAM-ID. BLOCK_METHOD_MAIN_CLASS_TEST_METHOD_GLOBAL.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:BLOCK_METHOD_MAIN_CLASS_TEST_METHOD_GLOBAL
           05  X            PIC 9(5).
           05  Y            PIC 9(5).
           05  RES          PIC 9(5).
