       IDENTIFICATION DIVISION.
       PROGRAM-ID. bubbleSort.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:bubbleSort
           05  i_bubbleSort PIC S9(5).
           05  j_bubbleSort PIC S9(5).
           05  temp_bubbleSort PIC S9(5).
