       IDENTIFICATION DIVISION.
       PROGRAM-ID. checkEvenOdd.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:checkEvenOdd
           05  sc           PIC X(10).
           05  n            PIC S9(5).
           05  rem          PIC S9(5).
