       IDENTIFICATION DIVISION.
       PROGRAM-ID. checkPalindrome.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:checkPalindrome
           05  check_checkPalindrome PIC X(100).
           05  i_checkPalindrome PIC S9(5).
