       IDENTIFICATION DIVISION.
       PROGRAM-ID. clearBitsInRange.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:clearBitsInRange
           05  a_clearBitsInRange PIC S9(5).
           05  b_clearBitsInRange PIC S9(5).
           05  mask_clearBitsInRange PIC S9(5).
           05  n_replaceBits PIC S9(5).
           05  i_replaceBits PIC S9(5).
           05  j_replaceBits PIC S9(5).
           05  m_replaceBits PIC S9(5).
