       IDENTIFICATION DIVISION.
       PROGRAM-ID. clearIthBit.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:clearIthBit
           05  mask_clearIthBit PIC S9(5).
           05  n_updateIthBit PIC S9(5).
           05  i_updateIthBit PIC S9(5).
           05  v_updateIthBit PIC S9(5).
