       IDENTIFICATION DIVISION.
       PROGRAM-ID. countWords.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:countWords
           05  count_countWords PIC S9(5).
           05  i_countWords PIC S9(5).
