       IDENTIFICATION DIVISION.
       PROGRAM-ID. count_bits.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:count_bits
           05  cnt_count_bits PIC S9(5).
           05  last_bit_count_bits PIC S9(5).
           05  n_count_bits_hack PIC S9(5).
