       IDENTIFICATION DIVISION.
       PROGRAM-ID. decimalToAnyBase.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:decimalToAnyBase
           05  rv_decimalToAnyBase PIC S9(5).
           05  p_decimalToAnyBase PIC S9(5).
           05  d_decimalToAnyBase PIC S9(5).
