       IDENTIFICATION DIVISION.
       PROGRAM-ID. display.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:display
           05  i_display    PIC S9(5).
           05  j_display    PIC S9(5).
