       IDENTIFICATION DIVISION.
       PROGRAM-ID. evenlyDivides.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:evenlyDivides
           05  temp_evenlyDivides PIC S9(5).
           05  count_evenlyDivides PIC S9(5).
           05  rem_evenlyDivides PIC S9(5).
