       IDENTIFICATION DIVISION.
       PROGRAM-ID. factorial.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:factorial
           05  fact_factorial PIC S9(5).
           05  i_factorial  PIC S9(5).
           05  n_NCR        PIC S9(5).
           05  r_NCR        PIC S9(5).
