       IDENTIFICATION DIVISION.
       PROGRAM-ID. findTriplet.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:findTriplet
           05  count_findTriplet PIC S9(5).
           05  i_findTriplet PIC S9(5).
           05  j_findTriplet PIC S9(5).
           05  k_findTriplet PIC S9(5).
