       IDENTIFICATION DIVISION.
       PROGRAM-ID. findLargest.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:findLargest
           05  rowidx_findLargest PIC S9(5).
           05  colidx_findLargest PIC S9(5).
           05  rowsum_findLargest PIC S9(5).
           05  colsum_findLargest PIC S9(5).
           05  i_findLargest PIC S9(5).
           05  rsum_findLargest PIC S9(5).
           05  j_findLargest PIC S9(5).
           05  csum_findLargest PIC S9(5).
