       IDENTIFICATION DIVISION.
       PROGRAM-ID. gcd.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:gcd
           05  rem_gcd      PIC S9(5).
           05  A_lcmAndGcd  PIC S9(5).
           05  B_lcmAndGcd  PIC S9(5).
