       IDENTIFICATION DIVISION.
       PROGRAM-ID. getCompressedString.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:getCompressedString
           05  output_getCompressedString PIC X(100).
           05  count_getCompressedString PIC S9(5).
           05  i_getCompressedString PIC S9(5).
