       IDENTIFICATION DIVISION.
       PROGRAM-ID. getDifference.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:getDifference
           05  ans_getDifference PIC S9(5).
           05  power_getDifference PIC S9(5).
           05  borrow_getDifference PIC S9(5).
           05  l1_getDifference PIC S9(5).
           05  l2_getDifference PIC S9(5).
           05  diff_getDifference PIC S9(5).
