       IDENTIFICATION DIVISION.
       PROGRAM-ID. getDigitFrequency.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:getDigitFrequency
           05  freq_getDigitFrequency PIC S9(5).
           05  dig_getDigitFrequency PIC S9(5).
