       IDENTIFICATION DIVISION.
       PROGRAM-ID. getIthBit.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:getIthBit
           05  mask_getIthBit PIC S9(5).
           05  n_setIthBit  PIC S9(5).
           05  i_setIthBit  PIC S9(5).
