       IDENTIFICATION DIVISION.
       PROGRAM-ID. getProduct.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:getProduct
           05  ans_getProduct PIC S9(5).
           05  power_getProduct PIC S9(5).
           05  l2_getProduct PIC S9(5).
           05  pwsd_getProduct PIC S9(5).
           05  b_gpwsd      PIC S9(5).
           05  n1_gpwsd     PIC S9(5).
           05  d2_gpwsd     PIC S9(5).
