       IDENTIFICATION DIVISION.
       PROGRAM-ID. getSum.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:getSum
           05  ans_getSum   PIC S9(5).
           05  carry_getSum PIC S9(5).
           05  power_getSum PIC S9(5).
           05  l1_getSum    PIC S9(5).
           05  l2_getSum    PIC S9(5).
           05  sum_getSum   PIC S9(5).
           05  q_getSum     PIC S9(5).
           05  r_getSum     PIC S9(5).
