       IDENTIFICATION DIVISION.
       PROGRAM-ID. getValueInBase.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:getValueInBase
           05  ans_getValueInBase PIC S9(5).
           05  power_getValueInBase PIC S9(5).
           05  r_getValueInBase PIC S9(5).
