       IDENTIFICATION DIVISION.
       PROGRAM-ID. getValueIndecimal.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:getValueIndecimal
           05  ans_getValueIndecimal PIC S9(5).
           05  power_getValueIndecimal PIC S9(5).
           05  ld_getValueIndecimal PIC S9(5).
