       IDENTIFICATION DIVISION.
       PROGRAM-ID. getValue.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:getValue
           05  d1_getValue  PIC S9(5).
           05  d2_getValue  PIC S9(5).
           05  n_anyBaseToDecimal PIC S9(5).
           05  b_anyBaseToDecimal PIC S9(5).
