       IDENTIFICATION DIVISION.
       PROGRAM-ID. gpwsd.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:gpwsd
           05  ans_gpwsd    PIC S9(5).
           05  power_gpwsd  PIC S9(5).
           05  carry_gpwsd  PIC S9(5).
           05  l1_gpwsd     PIC S9(5).
           05  product_gpwsd PIC S9(5).
           05  q_gpwsd      PIC S9(5).
           05  r_gpwsd      PIC S9(5).
           05  b_getSum     PIC S9(5).
           05  n1_getSum    PIC S9(5).
           05  n2_getSum    PIC S9(5).
