       IDENTIFICATION DIVISION.
       PROGRAM-ID. highestOccuringCharacter.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:highestOccuringCharacter
           05  count_highestOccuringCharacter PIC S9(5).
           05  idx_highestOccuringCharacter PIC S9(5).
           05  i_highestOccuringCharacter PIC S9(5).
           05  ch_highestOccuringCharacter PIC X(1).
           05  charcount_highestOccuringCharacter PIC S9(5).
           05  j_highestOccuringCharacter PIC S9(5).
