       IDENTIFICATION DIVISION.
       PROGRAM-ID. insertionSort.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:insertionSort
           05  i_insertionSort PIC S9(5).
           05  val_insertionSort PIC S9(5).
           05  j_insertionSort PIC S9(5).
