       IDENTIFICATION DIVISION.
       PROGRAM-ID. intersections.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:intersections
           05  n1_intersections PIC S9(5).
           05  n2_intersections PIC S9(5).
           05  i_intersections PIC S9(5).
           05  j_intersections PIC S9(5).
