       IDENTIFICATION DIVISION.
       PROGRAM-ID. AlphabetPosition.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  num PIC 9.


       PROCEDURE DIVISION.
       
       MOVE 1 TO num.
       DISPLAY FUNCTION MIN(2 FUNCTION MIN(num 5)).
       STOP RUN.