       IDENTIFICATION DIVISION.
       PROGRAM-ID. isPalindrome.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:isPalindrome
           05  left_isPalindrome PIC S9(5).
           05  right_isPalindrome PIC S9(5).
           05  str_solution PIC X(100).
