       IDENTIFICATION DIVISION.
       PROGRAM-ID. isPermutation.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:isPermutation
           05  check_isPermutation PIC X(1).
           05  count1_isPermutation PIC S9(5).
           05  count2_isPermutation PIC S9(5).
           05  i_isPermutation PIC S9(5).
