       IDENTIFICATION DIVISION.
       PROGRAM-ID. isPrime.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:isPrime
           05  i_isPrime    PIC S9(5).
           05  al_solution  PIC S9(5).
