       IDENTIFICATION DIVISION.
       PROGRAM-ID. lcmAndGcd.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:lcmAndGcd
           05  gcd_lcmAndGcd PIC S9(5).
           05  lcm_lcmAndGcd PIC S9(5).
