       IDENTIFICATION DIVISION.
       PROGRAM-ID. linearSearch.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:linearSearch
           05  i_linearSearch PIC S9(5).
