       IDENTIFICATION DIVISION.
       PROGRAM-ID. main.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:main
<<<<<<< HEAD
           05  scn_main     PIC X(100).
           05  str_main     PIC X(100).
=======
           05  a_main       PIC S9(5).
           05  b_main       PIC S9(5).
           05  i_main       PIC S9(5).
           05  n_main       PIC S9(5).
           05  j_main       PIC S9(5).
>>>>>>> 28b8c928417ac931a4bf3d5a3b0f39cef431571d
