       IDENTIFICATION DIVISION.
       PROGRAM-ID. main.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:main
           05  a            PIC S9(5).
           05  b            PIC S9(5).
           05  maxChar      PIC X(1).
           05  minChar      PIC X(1).
