       IDENTIFICATION DIVISION.
       PROGRAM-ID. main.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:main
<<<<<<< HEAD
           05  s_main       PIC X(100).
=======
           05  a_main       PIC S9(5).
>>>>>>> d0101356c30f8ca04a5b8847da13c60c00a185d3
