       IDENTIFICATION DIVISION.
       PROGRAM-ID. max.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:max
           05  maxVal_max   PIC S9(5).
           05  i_max        PIC S9(5).
