       IDENTIFICATION DIVISION.
       PROGRAM-ID. METHOD_ADD_CLASS_TEST_METHOD_GLOBAL.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:METHOD_ADD_CLASS_TEST_METHOD_GLOBAL
           05  X            PIC 9(5).
           05  Y            PIC 9(5).
