       IDENTIFICATION DIVISION.
       PROGRAM-ID. METHOD_MAIN_CLASS_TEST_METHOD_GLOBAL.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:METHOD_MAIN_CLASS_TEST_METHOD_GLOBAL
       01  ARGS_[SIZE=[]]-ARRAY.
           05  ARGS         PIC X(10) OCCURS 100 TIMES
