       IDENTIFICATION DIVISION.
       PROGRAM-ID. minJumps.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:minJumps
           05  jumps_minJumps PIC S9(5).
           05  currentEnd_minJumps PIC S9(5).
           05  farthest_minJumps PIC S9(5).
           05  i_minJumps   PIC S9(5).
