       IDENTIFICATION DIVISION.
       PROGRAM-ID. NCR.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:NCR
           05  factn_NCR    PIC S9(5).
           05  factr_NCR    PIC S9(5).
           05  factnr_NCR   PIC S9(5).
           05  n_probability PIC S9(5).
           05  x_probability PIC S9(5).
