       IDENTIFICATION DIVISION.
       PROGRAM-ID. pairSum.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:pairSum
           05  count_pairSum PIC S9(5).
           05  i_pairSum    PIC S9(5).
           05  j_pairSum    PIC S9(5).
