       IDENTIFICATION DIVISION.
       PROGRAM-ID. printMultiplesOf3.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:printMultiplesOf3
           05  i            PIC S9(5).
