       IDENTIFICATION DIVISION.
       PROGRAM-ID. printHello.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:printHello
           05  i            PIC S9(5).
