       IDENTIFICATION DIVISION.
       PROGRAM-ID. print2DArray.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:print2DArray
           05  i_print2DArray PIC S9(5).
           05  count_print2DArray PIC S9(5).
           05  j_print2DArray PIC S9(5).
