       IDENTIFICATION DIVISION.
       PROGRAM-ID. printSubstrings.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:printSubstrings
           05  count_printSubstrings PIC S9(5).
           05  i_printSubstrings PIC S9(5).
