       IDENTIFICATION DIVISION.
       PROGRAM-ID. pushZerosAtEnd.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:pushZerosAtEnd
           05  count_pushZerosAtEnd PIC S9(5).
           05  sumarr_pushZerosAtEnd PIC S9(5).
           05  i_pushZerosAtEnd PIC S9(5).
