       IDENTIFICATION DIVISION.
       PROGRAM-ID. removeConsecutiveDuplicates.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:removeConsecutiveDuplicates
           05  output_removeConsecutiveDuplicates PIC X(100).
           05  count_removeConsecutiveDuplicates PIC S9(5).
           05  i_removeConsecutiveDuplicates PIC S9(5).
           05  j_removeConsecutiveDuplicates PIC S9(5).
