       IDENTIFICATION DIVISION.
       PROGRAM-ID. removeAllOccurrencesOfChar.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:removeAllOccurrencesOfChar
           05  newstr_removeAllOccurrencesOfChar PIC X(100).
           05  i_removeAllOccurrencesOfChar PIC S9(5).
