       IDENTIFICATION DIVISION.
       PROGRAM-ID. reverse.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:reverse
           05  rev_reverse  PIC S9(5).
           05  rem_reverse  PIC S9(5).
