       IDENTIFICATION DIVISION.
       PROGRAM-ID. rowWiseSum.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:rowWiseSum
           05  i_rowWiseSum PIC S9(5).
           05  sum_rowWiseSum PIC S9(5).
           05  j_rowWiseSum PIC S9(5).
