       IDENTIFICATION DIVISION.
       PROGRAM-ID. secondLargestElement.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:secondLargestElement
           05  first_secondLargestElement PIC S9(5).
           05  second_secondLargestElement PIC S9(5).
           05  check_secondLargestElement PIC X(1).
           05  i_secondLargestElement PIC S9(5).
           05  i_secondLargestElement PIC S9(5).
