       IDENTIFICATION DIVISION.
       PROGRAM-ID. selectionSort.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:selectionSort
           05  i_selectionSort PIC S9(5).
           05  min_idx_selectionSort PIC S9(5).
           05  temp_selectionSort PIC S9(5).
           05  j_selectionSort PIC S9(5).
