       IDENTIFICATION DIVISION.
       PROGRAM-ID. setIthBit.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:setIthBit
           05  mask_setIthBit PIC S9(5).
           05  n_clearIthBit PIC S9(5).
           05  i_clearIthBit PIC S9(5).
