       IDENTIFICATION DIVISION.
       PROGRAM-ID. showMenu.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:showMenu
           05  sc           PIC X(10).
           05  choice       PIC S9(5).
