       IDENTIFICATION DIVISION.
       PROGRAM-ID. sort012.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:sort012
           05  zero_sort012 PIC S9(5).
           05  one_sort012  PIC S9(5).
           05  two_sort012  PIC S9(5).
           05  i_sort012    PIC S9(5).
           05  i_sort012    PIC S9(5).
