       IDENTIFICATION DIVISION.
       PROGRAM-ID. sortZeroesAndOne.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:sortZeroesAndOne
           05  total_sortZeroesAndOne PIC S9(5).
           05  i_sortZeroesAndOne PIC S9(5).
