       IDENTIFICATION DIVISION.
       PROGRAM-ID. spiralPrint.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:spiralPrint
           05  rstart_spiralPrint PIC S9(5).
           05  rend_spiralPrint PIC S9(5).
           05  cstart_spiralPrint PIC S9(5).
           05  cend_spiralPrint PIC S9(5).
           05  count_spiralPrint PIC S9(5).
           05  i_spiralPrint PIC S9(5).
