       IDENTIFICATION DIVISION.
       PROGRAM-ID. sum.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:sum
           05  sum_sum      PIC S9(5).
           05  j_sum        PIC S9(5).
