       IDENTIFICATION DIVISION.
       PROGRAM-ID. sumFirst10.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:sumFirst10
           05  sum          PIC S9(5).
           05  i            PIC S9(5).
