       IDENTIFICATION DIVISION.
       PROGRAM-ID. sumOfDivisors.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:sumOfDivisors
           05  sum_sumOfDivisors PIC S9(5).
           05  i_sumOfDivisors PIC S9(5).
