       IDENTIFICATION DIVISION.
       PROGRAM-ID. sumOfTwoArrays.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:sumOfTwoArrays
           05  carry_sumOfTwoArrays PIC S9(5).
           05  val_sumOfTwoArrays PIC S9(5).
           05  k_sumOfTwoArrays PIC S9(5).
           05  i_sumOfTwoArrays PIC S9(5).
           05  j_sumOfTwoArrays PIC S9(5).
