       IDENTIFICATION DIVISION.
       PROGRAM-ID. swapAlternate.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:swapAlternate
           05  i_swapAlternate PIC S9(5).
           05  temp_swapAlternate PIC S9(5).
