       IDENTIFICATION DIVISION.
       PROGRAM-ID. totalSum.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:totalSum
           05  sum_totalSum PIC S9(5).
           05  i_totalSum   PIC S9(5).
           05  j_totalSum   PIC S9(5).
