       IDENTIFICATION DIVISION.
       PROGRAM-ID. updateIthBit.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:updateIthBit
           05  mask_updateIthBit PIC S9(5).
           05  n_clearLastIBits PIC S9(5).
           05  i_clearLastIBits PIC S9(5).
