       IDENTIFICATION DIVISION.
       PROGRAM-ID. wavePrint.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables for Method:wavePrint
           05  i_wavePrint  PIC S9(5).
           05  j_wavePrint  PIC S9(5).
